Repository: easydev991/SwiftUI-SotkaApp
Catalog: SwiftUI-SotkaApp/SupportingFiles/Localizable.xcstrings
Source language: en
Languages: ru

source: %.1f sec
ru: %.1f сек

# %d min %d sec
source: %lld min %lld sec
ru: %lld мин %lld сек

source: %lld min
ru: %lld мин

source: %lld sec
ru: %lld сек

source: About app
ru: О приложении

# ageInYears
source: %lld years old
ru: %lld лет

# Alert.language
source: The language can be changed in the phone settings
ru: Язык можно поменять в настройках телефона

# Alert.logout
source: Log out of your profile?
ru: Выйти из учетной записи?

# Alert.PasswordChanged
source: Password has been changed
ru: Пароль успешно изменен

# Alert.resetSuccessful
source: Instructions for recovering your password have been sent to the email specified during registration
ru: Инструкция для восстановления пароля выслана на email, указанный при регистрации

# Alert.restorePassword
source: To recover your password, enter your login or email
ru: Для восстановления пароля введите логин или email

source: App language
ru: Язык приложения

source: App version
ru: Версия приложения

source: Are you sure you want to delete "%@"? This action cannot be undone.
ru: Вы уверены, что хотите удалить "%@"? Это действие нельзя отменить.

source: Australian pull-ups
ru: Подтягивания австралийские

source: Authorization
ru: Авторизация

source: Cancel
ru: Отмена

source: Change password
ru: Изменить пароль

source: Change profile photo
ru: Изменить фотографию

source: Choose icon
ru: Выберите иконку

source: Close
ru: Закрыть

# Common.Delete
source: Delete
ru: Удалить

# Congratulations.Body
source: You have successfully completed SOTKA!
ru: Вы успешно прошли программу SOTKA!

# Congratulations.Subtitle
source: days behind
ru: дней позади

# Congratulations.Title
source: Congratulations!
ru: Поздравляем!

source: Create exercise
ru: Создать упражнение

source: Create your first custom exercise
ru: Создайте своё первое упражнение

source: Created:
ru: Создано:

source: Current day
ru: Текущий день

source: Current password
ru: Текущий пароль

source: Custom exercises
ru: Редактор упражнений

source: Cycle
ru: Круг

source: Cycles
ru: Круги

source: Dark
ru: Тёмная

source: Dates
ru: Даты

# DateSync.Description
source: You have already started the program on the website. Please choose which progress to use.
ru: На сайте уже начато прохождение. Выберите, какое прохождение использовать.

# DateSync.Help.AppChoiceDescription
source: The program will continue from the day you stopped in the app. All app data will be saved, website data will be updated.
ru: Программа продолжится с того дня, где вы остановились в приложении. Все данные из приложения сохранятся, данные на сайте обновятся.

# DateSync.Help.AppChoiceTitle
source: If you choose progress from the app
ru: Если выбрать прогресс из приложения

# DateSync.Help.Introduction
source: Choose which progress will be primary — from the app or from the website. This will determine the program start date and which data will be saved.
ru: Выберите, какой прогресс будет основным — из приложения или с сайта. Это определит дату начала программы и какие данные будут сохранены.

# DateSync.Help.SiteChoiceDescription
source: The program will start from the day you stopped on the website. All website data will be saved, app data will be replaced.
ru: Программа начнется с того дня, где вы остановились на сайте. Все данные с сайта сохранятся, данные в приложении будут заменены.

# DateSync.Help.SiteChoiceTitle
source: If you choose progress from the website
ru: Если выбрать прогресс с сайта

# DateSync.Help.Summary
source: After your choice, data in the app and on the website will be synchronized — you can continue the program from the same day in both places.
ru: После выбора данные в приложении и на сайте синхронизируются — вы сможете продолжить программу с одного дня в обоих местах.

# DateSync.Help.Title
source: Details on Synchronization
ru: Подробно о синхронизации

# DateSync.Help.Warning
source: After your choice, data from the other option (the one you didn't select) will be replaced.
ru: После выбора данные из второго варианта (который вы не выбрали) будут заменены.

# DateSync.SelectAppDate
source: Use app data
ru: Выбрать приложение

# DateSync.SelectSiteDate
source: Use website data
ru: Выбрать сайт

# DateSync.Title
source: Synchronization
ru: Синхронизация

# Day %lld
source: Day %1$(number)lld
ru: День %(number)lld

# DayActivity.Comment.Placeholder
source: Describe this day...
ru: Опишите этот день…

# DayActivity.Comment.Save
source: Save
ru: Сохранить

# DayActivity.Comment.Title
source: Comment
ru: Комментарий

# DayNotCompleted
source: Not completed
ru: Не пройден

# Days left
source: Remaining
ru: Осталось

source: Delete Exercise
ru: Удалить упражнение

# demoExercise.boxJumps
source: Box Jumps
ru: Прыжки на тумбу

# demoExercise.burpees
source: Burpees
ru: Берпи

# demoExercise.clapPushUps
source: Clap Push-ups
ru: Отжимания с хлопком

source: Done
ru: Готово

source: Duration
ru: Длительность

source: Edit
ru: Изменить

# Edit profile
source: Edit your profile
ru: Изменить профиль

source: End Date
ru: Окончание

source: English
ru: Английский

source: Enter exercise name
ru: Введите название упражнения

source: Error
ru: Ошибка

# Error.AlternateIconsNotSupported
source: Alternate icons are not supported on this device
ru: Альтернативные иконки не поддерживаются на этом устройстве

# Error.CountriesUpdate
source: Failed to update countries
ru: Не удалось загрузить справочник стран и городов

# Error.ForceLogout
source: Re-login required for the app to function properly
ru: Для корректной работы приложения нужен повторный вход

# Error.NoConnection
source: Failed to load data. Check your internet connection.
ru: Не удалось загрузить данные. Проверьте подключение к интернету.

# Error.NotificationPermission
source: To receive workout reminders, you need to enable notification access in your phone settings
ru: Для напоминаний о тренировках необходимо дать доступ к уведомлениям в настройках телефона

# Error.PasswordMinLenght
source: At least 6 characters
ru: Минимум 6 символов

# Error.PasswordNotMatch
source: Passwords must match
ru: Пароли должны совпадать

# Error.TrainingExecutionTypeNotSelected
source: Execution type not selected
ru: Тип выполнения не выбран

# Error.TrainingTrainingsListEmpty
source: Exercise list is empty
ru: Список упражнений пуст

source: Exercise
ru: Упражнение

source: Exercise dates
ru: Даты создания и изменения

source: Exercise icon
ru: Иконка для упражнения

source: Exercise name
ru: Название упражнения

source: Exercise execution type
ru: Способ выполнения

# ExerciseType.Unknown
source: Unknown exercise type
ru: Неизвестное упражнение

source: Favorites
ru: Избранное

# Feedback.City
source: What city should we add?
ru: Какой город нужно добавить?

# Feedback.CommonQuestion
source: What should we work on?
ru: Над чем нам стоит поработать?

# Feedback.Country
source: What country should we add?
ru: Какую страну нужно добавить?

source: Font Size
ru: Размер шрифта

# FontSize.Large
source: Large
ru: Большой

# FontSize.Medium
source: Medium
ru: Средний

# FontSize.Small
source: Small
ru: Маленький

# Gender.Female
source: Female
ru: Женщина

# Gender.Female.Affiliation
source: Female
ru: Женский

# Gender.Male
source: Male
ru: Мужчина

# Gender.Male.Affiliation
source: Male
ru: Мужской

# Gender.NotSpecified.Afiliation
source: Not specified
ru: Не указан

source: General Information
ru: Общая информация

source: GitHub page
ru: Страница GitHub

source: Go to settings
ru: Перейти

source: Home
ru: Главная

# Home.Activity
source: Activity
ru: Активность

# Home.FillResults
source: Enter results
ru: Заполнить результаты

# Home.Progress
source: Progress
ru: Прогресс

source: Icon
ru: Иконка

# IconVariant %lld
source: Variant %lld
ru: Вариант %lld

# IconVariant.notSelected
source: Not selected
ru: Не выбрано

# IconVariant.primary
source: Primary icon
ru: Основная иконка

# IconVariant.selected
source: Selected
ru: Выбрано

source: Infopost
ru: Инфопост

# infopost.about
source: About the program
ru: О программе

# infopost.aims
source: Program goals
ru: Цели программы

# infopost.organizational
source: Organizational aspects
ru: Организационные моменты

source: Infoposts
ru: Инфопосты

# Infoposts.All
source: All
ru: Все

# Infoposts.DisplayMode
source: Display Mode
ru: Режим отображения

# Infoposts.Favorites
source: Favorites
ru: Избранные

source: Journal
ru: Дневник

# Journal.Comment
source: Comment
ru: Комментировать

# Journal.Delete
source: Delete
ru: Удалить

# Journal.DeleteEntry
source: Delete Entry
ru: Удалить запись

# Journal.DeleteEntryMessage
source: Are you sure you want to delete the entry for day %lld? This action cannot be undone.
ru: Вы уверены, что хотите удалить запись для дня %lld? Это действие нельзя отменить

# Journal.Edit
source: Edit
ru: Изменить

# Journal.SortAscending
source: Ascending
ru: По возрастанию

# Journal.SortDescending
source: Descending
ru: По убыванию

source: Journal display mode
ru: Режим отображения дневника

# JournalDisplayMode.Grid
source: Grid
ru: Сетка

# JournalDisplayMode.List
source: List
ru: Список

# JournalList.SortButton.label
source: Sort journal list
ru: Сортировать записи

source: Knees push-ups
ru: Отжимания с колен

source: Light
ru: Светлая

source: Loading …
ru: Загрузка ...

source: Log in
ru: Войти

source: Log out
ru: Выйти

source: Login or email
ru: Логин или email

# LoginScreen.AuthorizeButton.Title
source: Authorize
ru: Авторизация

# LoginScreen.RegistrationInfo.Text
source: Registration is available on 100.workout.su
ru: Регистрация доступна на сайте 100.workout.su

source: Lunges
ru: Выпады

# lunges92
source: Lunges (2 reps each leg)
ru: Выпады (2 раза на каждую ногу)

source: Modified:
ru: Изменено:

source: More
ru: Ещё

# MoreScreen.ResetProgramButton
source: Reset everything
ru: Сбросить всё

# MoreScreen.ResetProgramDialogConfirm
source: Reset
ru: Сбросить

# MoreScreen.ResetProgramDialogMessage
source: Training diary will be deleted, workouts will start from day one. This action cannot be undone.
ru: Дневник тренировок будет удалён, тренировки начнутся с первого дня. Это действие нельзя отменить.

# MoreScreen.ResetProgramDialogTitle
source: Reset program progress
ru: Сброс прохождения

# MoreScreen.ResetProgramSection
source: Start from scratch
ru: Начать с нуля

# MoreScreen.Rest.Group
source: Rest settings
ru: Параметры отдыха

# MoreScreen.SyncJournalButton
source: Sync Journal
ru: Журнал синхронизации

# MoreScreen.TimerSound
source: Sound
ru: Мелодия

# MoreScreen.Workout.Group
source: Workout
ru: Тренировки

source: New password
ru: Новый пароль

source: No custom exercises yet
ru: Упражнений пока нет

source: No entries
ru: Нет записей

source: Notification time
ru: Время тренировки

# Notification.DailyWorkoutBody
source: Time for your daily workout!
ru: Пришло время изменить себя!

source: Official website
ru: Официальный сайт

source: Ok
ru: Ок

source: Other apps
ru: Другие приложения

source: Password
ru: Пароль

source: Password confirmation
ru: Подтверждение пароля

# PhotoType.back
source: Back photo
ru: Фото сзади

# PhotoType.front
source: Front photo
ru: Фото спереди

# PhotoType.side
source: Side photo
ru: Фото сбоку

source: Pick from gallery
ru: Выбрать из галереи

# Placeholder.BirthDate
source: Date of birth
ru: Дата рождения

# Placeholder.City
source: City
ru: Город

# Placeholder.Country
source: Country
ru: Страна

# Placeholder.EnterNewPassword
source: Enter a new password
ru: Введите новый пароль

# Placeholder.EnterPassword
source: Enter current password
ru: Введите пароль

# Placeholder.Gender
source: Gender
ru: Пол

# Placeholder.Login
source: Login
ru: Логин

# Placeholder.Name
source: Name
ru: Имя

# Placeholder.Password
source: Password (6+ characters)
ru: Пароль (минимум 6 символов)

# Placeholder.RepeatNewPassword
source: New password again
ru: Новый пароль ещё раз

source: Profile
ru: Профиль

source: Progress
ru: Прогресс

# Progress.Delete.Button
source: Delete progress
ru: Удалить прогресс

source: Progress display mode
ru: Режим отображения прогресса

# Progress.Edit.ConfirmDelete.Message
source: Progress will be deleted, this action cannot be undone
ru: Прогресс будет удален, это действие нельзя отменить

# Progress.Edit.ConfirmDelete.Title
source: Delete progress?
ru: Удалить прогресс?

# Progress.Edit.Delete
source: Delete
ru: Удалить

# Progress.Edit.Enter
source: Enter
ru: Ввести

# Progress.Edit.Footer
source: Enter your current data - this will help you track your progress as you go through the program
ru: Укажи свои текущие данные - это поможет тебе отслеживать прогресс по мере прохождения программы

# Progress.Edit.Header
source: Maximum Repetitions
ru: Максимальное количество повторений

# Progress.Edit.Save
source: Save
ru: Сохранить

# Progress.Edit.Title
source: Enter data
ru: Внести данные

# Progress.Error.NotFound %lld
source: Progress for day %lld not found
ru: Прогресс за день %lld не найден

# Progress.Metrics
source: Metrics
ru: Показатели

# Progress.Photo.DeleteMessage %@
source: %@ will be deleted permanently
ru: %@ будет удалено без возможности восстановления

# Progress.Photo.DialogTitle
source: Action with the photo
ru: Действие с фотографией

# Progress.Photos
source: Photos
ru: Фотографии

# Progress.WeightUnit
source: kg
ru: кг

# progressActivityTitle
source: Activity
ru: Активность

# progressFullProgressTitle
source: Total progress
ru: Полный прогресс

# progressInfoPostsTitle
source: Infoposts
ru: Инфопосты

# ProgressSection.End
source: End
ru: Конец

# ProgressSection.Middle
source: Middle
ru: Середина

# ProgressSection.Start
source: Start
ru: Начало

# progressStatsLegend
source: Legend
ru: Легенда

# progressStatsMetrics
source: Total stats
ru: Общая статистика

# progressStatsTitle
source: Your progress stats
ru: Статистика твоего прогресса

# progressStatusCompleted
source: Fully completed day
ru: Полностью пройденный день

# progressStatusCurrentDay
source: Current day
ru: Текущий день

# progressStatusNotStarted
source: Not started day
ru: Предстоящий день

# progressStatusPartial
source: Partially completed day
ru: Частично завершенный день

# progressStatusSkipped
source: Skipped day
ru: Пропущенный день

# ProgressTip.StatsView.Message
source: Tap to see details
ru: Нажми, чтобы увидеть детали

# ProgressTip.StatsView.Title
source: Program stats
ru: Статистика прохождения

source: Pull-ups
ru: Подтягивания

source: Push-ups
ru: Отжимания

# pushUps970
source: Decline push-ups
ru: Отжимания с ногами на возвышенности

# pushUps971
source: Push-ups
ru: Отжимания от пола

# pushUps972
source: Incline push-ups
ru: Отжимания с руками на возвышенности

source: Rate the app
ru: Оценить приложение

source: Report
ru: Отчет

# resetProgram
source: Start from scratch
ru: Начать с нуля

# RestCompleted
source: Rest is over, let's continue training!
ru: Отдых завершён - продолжаем!

# RestDay
source: Rest
ru: Отдых

# Restore password
source: Restore your password
ru: Восстановить пароль

# RestTimePicker
source: Duration
ru: Длительность

source: Russian
ru: Русский

source: Save
ru: Сохранить

source: Save changes
ru: Сохранить изменения

# Section.AdvancedBlock
source: Advanced block
ru: Продвинутый блок

# Section.BasicBlock
source: Basic block
ru: Базовый блок

# Section.Conclusion
source: Conclusion
ru: Заключение

# Section.Preparation
source: Preparation
ru: Подготовка

# Section.TurboBlock
source: Turbo block
ru: Турбо блок

source: Send feedback
ru: Отправить обратную связь

source: Set
ru: Подход

source: Sets
ru: Подходы

source: Settings
ru: Настройки

source: Share the app
ru: Поделиться приложением

# SickDay
source: Sick
ru: Болезнь

source: Squats
ru: Приседания

source: Street Workout Parks
ru: Street Workout Площадки

# StretchDay
source: Stretch
ru: Растяжка

source: Support the project
ru: Поддержать проект

source: Sync Journal
ru: Журнал синхронизации

# SyncJournal.ConfirmDeleteAll.Message
source: All sync journal entries will be deleted. This action cannot be undone.
ru: Все записи журнала синхронизаций будут удалены. Это действие нельзя отменить.

# SyncJournal.ConfirmDeleteAll.Title
source: Delete all sync journal entries?
ru: Удалить все записи журнала?

# SyncJournal.DeleteAll
source: Delete All
ru: Удалить все

# SyncJournal.EmptyState.Description
source: Sync entries will appear here after the first sync
ru: Записи появятся после первой синхронизации

# SyncJournalDetailScreen.ActivitiesTitle
source: Activities
ru: Активности

# SyncJournalDetailScreen.Created
source: Created
ru: Создано

# SyncJournalDetailScreen.Deleted
source: Deleted
ru: Удалено

# SyncJournalDetailScreen.ErrorsTitle
source: Errors
ru: Ошибки

# SyncJournalDetailScreen.ExercisesTitle
source: Exercises
ru: Упражнения

# SyncJournalDetailScreen.ProgressTitle
source: Progress
ru: Прогресс

# SyncJournalDetailScreen.Result
source: Result
ru: Результат

# SyncJournalDetailScreen.StartDate
source: Start Date
ru: Начало

# SyncJournalDetailScreen.StatisticsTitle
source: Sync Statistics
ru: Статистика синхронизации

# SyncJournalDetailScreen.Title
source: Details
ru: Детали синхронизации

# SyncJournalDetailScreen.Updated
source: Updated
ru: Обновлено

# SyncJournalRowView.InProgress
source: In progress...
ru: В процессе...

# SyncResultDetails.SummaryCreated
source: Created: %lld
ru: Создано: %lld

# SyncResultDetails.SummaryDeleted
source: Deleted: %lld
ru: Удалено: %lld

# SyncResultDetails.SummaryUpdated
source: Updated: %lld
ru: Обновлено: %lld

# SyncResultType.Error
source: Error
ru: Ошибка

# SyncResultType.Partial
source: Partial
ru: Частично

# SyncResultType.Success
source: Success
ru: Успешно

source: System
ru: Системная

source: Take a photo
ru: Сделать фото

# ThemeIconScreen.iconSection
source: App Icon
ru: Иконка приложения

# ThemeIconScreen.themePicker
source: App Theme
ru: Тема приложения

# ThemeIconScreen.Title
source: App Theme & Icon
ru: Тема и иконка

# TimerScreen.FinishButton
source: Finish rest
ru: Завершить отдых

# TimerScreen.Title
source: Rest
ru: Отдых

# TimerSoundToggle
source: Play sound after rest
ru: Звук в конце

# TimerVibrateToggle
source: Vibrate after rest
ru: Вибрация в конце

# TrainingRowView.stepper.label
source: Change count
ru: Изменить количество

source: Turbo
ru: Турбо

# Turbo 93-1
source: Pull-ups with alternating amplitude
ru: Подтягивания с поочередной амплитудой

# Turbo 93-2
source: Pull-ups with different grip width
ru: Подтягивания с разной шириной хвата

# Turbo 93-3
source: Pull-ups with static hold
ru: Подтягивания со статическим удержанием

# Turbo 93-4
source: Pull-ups with grip change
ru: Подтягивания со сменой хвата

# Turbo 93-5
source: Maximum neutral grip pull-ups
ru: Подтягивания нейтральным хватом на максимум

# Turbo 94 pull-ups
source: Tuck L-sit pull-ups
ru: Подтягивания с согнутыми ногами

# Turbo 94 push-ups
source: Hindu push-ups
ru: Индийские отжимания

# Turbo 94 squats
source: Spartan squats
ru: Спартанские наклоны

# Turbo 95-1
source: 1 minute Horseman - 10 jump squats
ru: 1 минута стульчик - 10 прыжков

# Turbo 95-2
source: 1 minute Horseman - 10 jump squats
ru: 1 минута стульчик - 10 прыжков

# Turbo 95-3
source: 1 minute Horseman - 10 jump squats
ru: 1 минута стульчик - 10 прыжков

# Turbo 95-4
source: 1 minute Horseman - 10 jump squats
ru: 1 минута стульчик - 10 прыжков

# Turbo 95-5
source: 1 minute Horseman - 10 jump squats
ru: 1 минута стульчик - 10 прыжков

# Turbo 96 pull-ups
source: Pull-ups (slow)
ru: Медленные подтягивания

# Turbo 96 push-ups
source: Push-ups (slow)
ru: Медленные отжимания

# Turbo 96 squats
source: Squats (slow)
ru: Медленные приседания

# Turbo 97 push-ups high
source: Decline push-ups
ru: Отжимания с ногами на возвышенности

# Turbo 97 push-ups high arms
source: Incline push-ups
ru: Отжимания с руками на возвышенности

# Turbo 98 pull-ups
source: Pull-ups (ladder)
ru: Подтягивания (лесенка)

# Turbo 98 push-ups
source: Push-ups (ladder)
ru: Отжимания (лесенка)

# Turbo 98 squats
source: Squats (ladder)
ru: Приседания (лесенка)

# Watch.AuthRequired.CheckButton
source: Check Authorization
ru: Проверить авторизацию

# Watch.AuthRequired.Checking
source: Checking status...
ru: Проверяем статус…

# Watch.AuthRequired.Error
source: Authorization error
ru: Ошибка авторизации

# Watch.AuthRequired.Message
source: Sign in on your iPhone app
ru: Авторизуйтесь в приложении на iPhone

source: Weight
ru: Вес

source: Workout notifications
ru: Напоминать о тренировке

source: WORKOUT shop
ru: Магазин WORKOUT

# Workout.CompleteStep
source: Done
ru: Готово

# Workout.InProgress
source: In progress…
ru: Выполнение…

# WorkoutDay
source: Workout
ru: Тренировка

# WorkoutExerciseEditor.CreateExercise
source: Create exercise
ru: Создать упражнение

# WorkoutExerciseEditor.CustomExercises
source: Custom exercises
ru: Пользовательские упражнения

# WorkoutExerciseEditor.DayExercises
source: Day exercises
ru: Упражнения дня

# WorkoutExerciseEditor.Done
source: Done
ru: Готово

# WorkoutExerciseEditor.StandardExercises
source: Standard exercises
ru: Стандартные упражнения

# WorkoutExerciseEditor.Title
source: Workout editor
ru: Редактор тренировки

# WorkoutPreview.RestTimePicker
source: Rest duration
ru: Отдых

# WorkoutPreview.Save
source: Save
ru: Сохранить

# WorkoutPreview.SaveAsPassed
source: Save as completed
ru: Сохранить как пройденную

# WorkoutPreview.StartTraining
source: Start training
ru: Начать тренировку

# WorkoutPreview.Title%lld
source: Workout (day %lld)
ru: Тренировка (день %lld)

# WorkoutScreen.ExercisesReminder
source: Exercises
ru: Упражнения

# WorkoutScreen.StopWorkout.Button
source: Stop Workout
ru: Прервать тренировку

# WorkoutScreen.StopWorkout.ConfirmButton
source: Finish
ru: Завершить

# WorkoutScreen.StopWorkout.Message
source: Are you sure you want to stop the workout?
ru: Вы уверены, что хотите прервать тренировку?

# WorkoutScreen.StopWorkout.Title
source: Stop Workout
ru: Прервать тренировку

# WorkoutScreen.Title
source: Workout
ru: Тренировка

# WorkoutStep.CoolDown
source: Cool-down
ru: Заминка

# WorkoutStep.WarmUp
source: Warm-up
ru: Разминка
